src/example/Catalogs/Example_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Example_Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/example/Catalogs/Example_Контрагенты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция СоздатьКонтрагента(ОписаниеКонтрагента) Экспорт
	
	Контрагент = СоздатьЭлемент();
	Контрагент.Заполнить(ОписаниеКонтрагента);
	Если Не Контрагент.ПроверитьЗаполнение() Тогда
		ТекстШаблонаОшибки = НСтр("ru='Не удалось записать контрагента %1 с ИНН %2'");
		ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, ОписаниеКонтрагента.Наименование, ОписаниеКонтрагента.ИНН);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Контрагент.Записать();
	
КонецФункции

Функция АктивныеКонтрагенты() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Example_Контрагенты.Наименование КАК Наименование,
	|	Example_Контрагенты.ИНН КАК ИНН,
	|	Example_Контрагенты.КПП КАК КПП
	|ИЗ
	|	Справочник.Example_Контрагенты КАК Example_Контрагенты
	|ГДЕ
	|	НЕ Example_Контрагенты.Недействителен
	|	И НЕ Example_Контрагенты.ЭтоГруппа
	|	И НЕ Example_Контрагенты.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
